---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.ReverseIterator
source: html/48363e00-bf3b-f494-d41f-f4dd12407ccd.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.ReverseIterator Method

## Syntax (C#)
```csharp
public virtual AssetSetIterator ReverseIterator()
```